ArturChechui/player/sdkconfig.defaults
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=n

CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# I2S support
CONFIG_ESP_DRIVER_I2S=y

# HTTP client
CONFIG_ESP_HTTP_CLIENT_ENABLE_DIGEST_AUTH=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=y
